#include "pch.h"
#include "USER_PIC_FLIP.h"

/*
********************************************************************************
********************************************************************************
*                               构造&析构函数
********************************************************************************
********************************************************************************
*/

/*
******************************************************************************
* 函数名称:	USER_PIC_FLIP
* 函数功能: 构造（初始化）函数
* 输入参数:	ARRAY1 ：bmp图像的RGB三通道数据, h ：图像高  w:图像宽
* 输出参数:	none
* 返 回 值:  void
* 创建日期:  2021年-10月-30日
* 注    意:
*******************************************************************************
*/
USER_PIC_FLIP::USER_PIC_FLIP(BYTE* ARRAY1, int h, int w)
{
	pixelArray = ARRAY1;
	high = h;
	width = w;
	ArraySize = high * width * 3;

	R_array = (BYTE*)new char[ArraySize / 3 + 1];
	G_array = (BYTE*)new char[ArraySize / 3 + 1];
	B_array = (BYTE*)new char[ArraySize / 3 + 1];
}

/*
******************************************************************************
* 函数名称:	~USER_PIC_FLIP
* 函数功能: 析构函数，将动态开辟的空间清除
* 输入参数:	none
* 输出参数:	none
* 返 回 值:  void
* 创建日期:  2021年-10月-30日
* 注    意:
*******************************************************************************
*/
USER_PIC_FLIP::~USER_PIC_FLIP()
{
	delete[] R_array;
	delete[] G_array;
	delete[] B_array;
}

/*
********************************************************************************
********************************************************************************
*                               接口函数
********************************************************************************
********************************************************************************
*/


/*
******************************************************************************
* 函数名称:	Filp
* 函数功能: 翻转
* 输入参数:	none
* 输出参数:	none
* 返 回 值:  void
* 创建日期:  2021年-10月-30日
* 注    意:
*******************************************************************************
*/
void USER_PIC_FLIP::Filp()
{
	SeparateRGB();
	PicFilp(0);
	UnionRGB();
}



/*
********************************************************************************
********************************************************************************
*                               功能函数
********************************************************************************
********************************************************************************
*/

/*
******************************************************************************
* 函数名称:	SeparateRGB
* 函数功能: 分离RGB分量
* 输入参数:	none
* 输出参数:	none
* 返 回 值:  void
* 创建日期:  2021年-10月-19日
* 注    意:
*******************************************************************************
*/
void USER_PIC_FLIP::SeparateRGB()
{
	int j = 0;
	for (int i = 0; i < ArraySize; i = i + 3)
	{
		R_array[j] = pixelArray[i + 2];
		G_array[j] = pixelArray[i + 1];
		B_array[j] = pixelArray[i + 0];

		j++;
	}
}

/*
******************************************************************************
* 函数名称:	UnionRGB
* 函数功能: RGB分量整合
* 输入参数: none
* 输出参数:	none
* 返 回 值:  void
* 创建日期:  2021年-10月-19日
* 注    意:
*******************************************************************************
*/
void USER_PIC_FLIP::UnionRGB()
{
	int j = 0;
	for (int i = 0; i < ArraySize; i = i + 3)
	{
		pixelArray[i + 2] = R_array[j];
		pixelArray[i + 1] = G_array[j];
		pixelArray[i + 0] = B_array[j];

		j++;
	}
}

/*
******************************************************************************
* 函数名称:	PicFilp
* 函数功能: 翻转函数
* 输入参数:	flag : 0 水平翻转  1 垂直翻转
* 输出参数:	none
* 返 回 值:  void
* 创建日期:  2021年-10月-30日
* 注    意:  
*******************************************************************************
*/
void USER_PIC_FLIP::PicFilp(int flag)
{
	switch (flag)
	{
		case 0:
			HFilp();
			break;
		case 1:
			VFilp();
			break;
		default:
			break;
	}
}

/*
******************************************************************************
* 函数名称:	HFilp
* 函数功能: 水平翻转函数
* 输入参数:	none
* 输出参数:	none
* 返 回 值:  void
* 创建日期:  2021年-10月-31日
* 注    意:
*******************************************************************************
*/
void USER_PIC_FLIP::HFilp()
{
	//动态建立二维数组
	BYTE** matrixR;
	BYTE** matrixG;
	BYTE** matrixB;
	matrixR = new BYTE * [high];
	matrixG = new BYTE * [high];
	matrixB = new BYTE * [high];
	for (int j = 0; j < high; j++)
	{
		matrixR[j] = new BYTE[width];
		matrixG[j] = new BYTE[width];
		matrixB[j] = new BYTE[width];
	}

	//初始化，向量转矩阵
	int k = 0;
	for (int i = 0; i < high; i++)
	{
		for (int j = 0; j < width; j++)
		{
			matrixR[i][j] = R_array[k];
			matrixG[i][j] = G_array[k];
			matrixB[i][j] = B_array[k];
			k++;
		}
	}

	//调用用户自定义的算法类，使用交换函数
	USER_ALG user_alg;
	for (int j = 0; j < width/2 - 1; j++) //j 列
	{
		for (int i = 0; i < high; i++)// i 行
		{
			user_alg.Swap(&matrixR[i][j], &matrixR[i][width - 1 - j]);
			user_alg.Swap(&matrixG[i][j], &matrixG[i][width - 1 - j]);
			user_alg.Swap(&matrixB[i][j], &matrixB[i][width - 1 - j]);
		}
	}

	//矩阵转向量
	k = 0;
	for (int i = 0; i < high; i++)
	{
		for (int j = 0; j < width; j++)
		{
			R_array[k] = matrixR[i][j];
			G_array[k] = matrixG[i][j];
			B_array[k] = matrixB[i][j];
			k++;
		}
	}

	//释放
	for (int j = 0; j < high; j++)
	{
		delete[] matrixR[j];
		delete[] matrixG[j];
		delete[] matrixB[j];
	} 
	delete[] matrixR;
	delete[] matrixG;
	delete[] matrixB;
}

/*
******************************************************************************
* 函数名称:	VFilp
* 函数功能: 垂直翻转函数
* 输入参数:	none
* 输出参数:	none
* 返 回 值:  void
* 创建日期:  2021年-10月-31日
* 注    意:
*******************************************************************************
*/
void USER_PIC_FLIP::VFilp()
{

}
